### [인덱스 다루기]
- 기본 인덱스
    * .set_index() <- 컬럼을 인덱스로 설정
    * .reindex() <- 인덱스 재구성(일부 변경. 결측치 발생 가능)
    * .reset_index() <- 위치인덱스(RangeIndex)로 변경. 기존 인덱스는 컬럼에 추가
- 멀티 인덱스

[1] 모듈 로딩 및 데이터 준비 <hr>

In [608]:
# 모듈 로딩
import pandas as pd

In [609]:
# 데이터 준비
FILE_NAME = '../DATA/학생관리부.xlsx'

# dataDF = pd.read_excel(FILE_NAME)
# skiparows=n: 데이터 파일에서 n개 버리기
# index_col=위치인덱스 or 컬럼이름
# dataDF = pd.read_excel(FILE_NAME, skiprows=2, index_col='이름')
dataDF = pd.read_excel(FILE_NAME, skiprows=2)

In [610]:
# 확인
dataDF.head(5)

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

[2] 데이터프레임에서 인덱스 관련 메서드 다루기 <hr>

In [611]:
# ====================================================
## [2-1] 컬럼을 인덱스로 설정하기: .set_index()
# ====================================================
dataDF2 = dataDF.set_index(['이름']).sort_index().copy()
dataDF2

     학년  반   석차
이름
고길동   1  3    1
박길동   3  1    9
이길동   1  7   12
최길동   2  1   43
홍길동   1  1    8

In [612]:
# [실습] 석차 컬럼을 행 인덱스로 설정, 내림차순으로 정렬해서 저장하기
dataDF3 = dataDF.set_index([' 석차']).sort_index(ascending=False)
# dataDF3.sort_index(ascending=True, inplace=True)
dataDF3

      이름  학년  반
 석차
43   최길동   2  1
12   이길동   1  7
9    박길동   3  1
8    홍길동   1  1
1    고길동   1  3

In [613]:
# [매개변수 활용] 특정 컬럼이 행인덱스 가능한지 검사 진행
#               대량의 데이터의 경우 행 중복값 검사를 눈으로 하기 어려움
#               verify_integrity=True, 행 중복 체크
# dataDF3 = dataDF.set_index(['학년'], verify_integrity=True)

In [614]:
# [문제] 2개 이상의 컬럼을 조합해서 행인덱스로 설정된 데이터 프레임을 만들기
dataDF4 = dataDF.set_index(['이름', ' 석차'], verify_integrity=True)
dataDF4.sort_index(level=[' 석차', '이름'], ascending=[True, True], inplace=True)

dataDF4

         학년  반
이름   석차
고길동 1     1  3
홍길동 8     1  1
박길동 9     3  1
이길동 12    1  7
최길동 43    2  1

In [615]:
# ==========================================================
# [2-2] 인덱스 재구성/재배치: .reindex(index=[], columns=[])
#                          .reindex(index=[], axis=0 또는 1)
# ==========================================================
dataDF

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

In [616]:
# 이름, 학년, 반, 석차 ==> 학년, 반, 이름, 석차로 열이름/열인덱스를 재배치/재구성
# dataDF.reindex(labels=['학년', '반', '이름', '석차'], axis=1)
dataDF.reindex(columns=['학년', '반', '이름', '석차'])

   학년  반   이름  석차
0   1  1  홍길동 NaN
1   1  3  고길동 NaN
2   1  7  이길동 NaN
3   3  1  박길동 NaN
4   2  1  최길동 NaN

In [617]:
# 이름, 학년, 반, 석차 ==> 학교, 이름, 학년, 반, 번호   열이름/열인덱스를 재배치/재구성
# -> 기존 없던 것 추가: 학년, 번호
# -> 기존 있던 것 제거: 석차
# dataDF.reindex(labels=['학교', '이름', '학년', '반', '번호'], axis='columns')
dataDF.reindex(columns=['학교', '이름', '학년', '반', '번호'], fill_value='unknown') # 결측치 -> unknown으로

        학교   이름  학년  반       번호
0  unknown  홍길동   1  1  unknown
1  unknown  고길동   1  3  unknown
2  unknown  이길동   1  7  unknown
3  unknown  박길동   3  1  unknown
4  unknown  최길동   2  1  unknown

In [618]:
# =====================================================
# [2-3] 인덱스 초기화: .reset_index()
#                    기존 행인덱스는 컬럼으로 추가됨
# =====================================================
display(dataDF)

# 행인덱스 초기화 => [기본값: 행인덱스 -> 컬럼 추가]
dataDF2 = dataDF.reset_index()
display(dataDF2)

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

   index   이름  학년  반   석차
0      0  홍길동   1  1    8
1      1  고길동   1  3    1
2      2  이길동   1  7   12
3      3  박길동   3  1    9
4      4  최길동   2  1   43

In [619]:
# 행인덱스 초기화 => [설정: 행인덱스 -> 컬럼 추가X
dataDF2 = dataDF.reset_index(drop=True)
display(dataDF2)

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

In [620]:
# -----------------------------------------------
# [실습] 현재 행인덱스 초기화: 컬럼으로 전달되는 행인덱스 삭제 여부 결정
#                           필요없는 데이터 drop=True
#                           필요 있는 데이터 drop=False     <--- 기본값
# -----------------------------------------------
dataDF = pd.DataFrame([('bird', 389.0),
                        ('bird', 24.0),
                        ('mammal', 80.5),
                        ('mammal', pd.NA)],
                        index=['falcon', 'parrot', 'lion', 'monkey'],
                        columns=('class', 'max_speed'))
display(dataDF)

# 컬럼 추가된 경우 컬럼명 지정 매개변수: names=컬럼명
dataDF2 = dataDF.reset_index(names='kind')
display(dataDF2)

         class max_speed
falcon    bird     389.0
parrot    bird      24.0
lion    mammal      80.5
monkey  mammal      <NA>

     kind   class max_speed
0  falcon    bird     389.0
1  parrot    bird      24.0
2    lion  mammal      80.5
3  monkey  mammal      <NA>

In [621]:
dataDF3 = dataDF2.set_index('kind')
dataDF3

         class max_speed
kind
falcon    bird     389.0
parrot    bird      24.0
lion    mammal      80.5
monkey  mammal      <NA>